Revit 2027 API
PhaseArray.Insert Method
Insert the specified phase into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	Phase item,
	int index
)
Public Overridable Sub Insert (
	item As Phase,
	index As Integer
)
public:
virtual void Insert(
	Phase^ item,
	int index
)
abstract Insert :
        item : Phase *
        index : int -> unit
override Insert :
        item : Phase *
        index : int -> unit
Parameters
item Phase
The phase to be inserted into the array.
index Int32
The phase will be inserted before this index.
Return Value
Returns whether the phase was inserted into the array.
See Also
Reference
PhaseArray Class
Autodesk.Revit.DB Namespace